function Footer() {

   const footerFirst = 'Oson Apteka '

   return (
      <footer className="">
         <div className="first_footer">
            <h1 className="first_footer-about">
               Справочник аптек — универсальный помощник для бизнеса и потребителя
            </h1>
            <p className="first_footer-text">
               <span className="footer_first">{footerFirst}</span> — универсальный справочник аптек для современного человека. Поисковый сервис помогает быстро сэкономить время и деньги на приобретение лекарственных средств. Больше нет необходимости самостоятельно ездить по городу, обзванивать множество аптек в поисках нужного препарата. Достаточно воспользоваться справочником лекарств по Узбекистану.
            </p>
         </div>
         <div className="first_footer">
            <h1 className="first_footer-about">
               Преимущества справочника лекарств
            </h1>
            <p className="first_footer-text">
               Весь фармакологический бизнес построен на тесном
                взаимодействии производителя и потребителя через 
                посредника — розничную сеть аптек. Когда речь идет
               о здоровье и жизни (в прямом смысле слова), любые
               промедления недопустимы. К сожалению, в реалиях
                современной жизни, когда у человека попросту нет
                времени на походы по аптекам, важно чтобы под рукой 
                всегда был быстрый поиск подходящего препарата в удаленном
               режиме. Справочник лекарств <span className="footer_first">{footerFirst}</span>
               выступает тем связующим звеном между клиентом и бизнесом.
            </p>
         </div>
      </footer>
   );
}
export default Footer