


function MiddleFooter(){

     const footerFirst = ' Oson Apteka '

    return(
        <footer className="middle_foter">
            <div className="middle_footer-title">
                <h1 className="main_middleFooter-text">
                    Поисковый сервис — уникальный. Его преимущества
                     одинаково хороши как для владельцев аптек, так
                      и для покупателей:
                </h1>
            </div>
            <div className="footer_info">
                <div className="middle_footer-img">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg" className="_icon" data-v-45c0c5d5=""><rect width="48" height="48" rx="24" fill="#F4F5F7"></rect><path fill-rule="evenodd" clip-rule="evenodd" d="M28.1583 20.2329C28.1583 22.5825 26.2851 24.4666 23.949 24.4666C21.6129 24.4666 19.7397 22.5825 19.7397 20.2329C19.7397 17.8823 21.6129 16 23.949 16C26.2851 16 28.1583 17.8823 28.1583 20.2329ZM23.949 32C20.5178 32 17.5881 31.456 17.5881 29.2802C17.5881 27.1034 20.499 26.5396 23.949 26.5396C27.3802 26.5396 30.31 27.0836 30.31 29.2604C30.31 31.4362 27.399 32 23.949 32ZM29.9571 20.3092C29.9571 21.507 29.5998 22.6229 28.973 23.5505C28.9086 23.646 28.9659 23.7748 29.0796 23.7946C29.2363 23.8216 29.3984 23.8369 29.5631 23.8414C31.2062 23.8846 32.6809 22.821 33.0883 21.2197C33.6918 18.8412 31.9198 16.7059 29.6634 16.7059C29.4181 16.7059 29.1835 16.732 28.9551 16.7788C28.9238 16.786 28.8907 16.8005 28.8728 16.8284C28.8513 16.8626 28.8674 16.9085 28.8889 16.9383C29.5667 17.8938 29.9571 19.0592 29.9571 20.3092ZM32.6782 25.5126C33.7823 25.7296 34.5084 26.1727 34.8093 26.8166C35.0636 27.3453 35.0636 27.9586 34.8093 28.4864C34.349 29.4851 32.8654 29.8058 32.2887 29.8886C32.1696 29.9066 32.0738 29.8031 32.0864 29.6833C32.3809 26.9157 30.0377 25.6035 29.4315 25.3018C29.4055 25.2883 29.4002 25.2676 29.4028 25.255C29.4046 25.246 29.4154 25.2316 29.4351 25.2289C30.7468 25.2046 32.1571 25.3847 32.6782 25.5126ZM18.4371 23.8413C18.6019 23.8368 18.763 23.8224 18.9206 23.7945C19.0343 23.7747 19.0916 23.6459 19.0272 23.5504C18.4004 22.6228 18.0431 21.5069 18.0431 20.3091C18.0431 19.0591 18.4335 17.8937 19.1113 16.9382C19.1328 16.9084 19.1481 16.8625 19.1275 16.8283C19.1096 16.8013 19.0755 16.786 19.0451 16.7788C18.8159 16.7319 18.5813 16.7058 18.3359 16.7058C16.0795 16.7058 14.3075 18.8411 14.9119 21.2196C15.3193 22.8209 16.794 23.8845 18.4371 23.8413ZM18.5969 25.2545C18.5996 25.268 18.5943 25.2878 18.5692 25.3022C17.9621 25.6039 15.6188 26.9161 15.9134 29.6827C15.926 29.8034 15.831 29.9061 15.712 29.889C15.1353 29.8061 13.6516 29.4855 13.1914 28.4867C12.9362 27.9581 12.9362 27.3457 13.1914 26.817C13.4922 26.1731 14.2175 25.73 15.3216 25.512C15.8436 25.385 17.2529 25.2049 18.5656 25.2292C18.5853 25.2319 18.5951 25.2464 18.5969 25.2545Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="35.0031" y1="20.9808" x2="12.9981" y2="20.917" gradientUnits="userSpaceOnUse"><stop stop-color="#3F74D1"></stop><stop offset="1" stop-color="#5B96E7"></stop></linearGradient></defs></svg>
                </div>
                <div className="middle_footer-text">
                    <h1 className="middle_footer-about">Удобный и понятный интерфейс.
                         В отличие от многих современных приложений, аптечным поиском 
                         могут пользоваться все возрастные группы. Даже старшее поколение
                          разберется с простой навигацией на странице и принципом 
                          работы справочника лекарств.</h1>
                </div>
            </div>
            <div className="footer_info">
                <div className="middle_footer-img">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg" class="_icon" data-v-45c0c5d5=""><rect width="48" height="48" rx="24" fill="#F4F5F7"></rect><path fill-rule="evenodd" clip-rule="evenodd" d="M19.6701 14H28.3401C31.7301 14 34.0001 16.38 34.0001 19.92V28.091C34.0001 31.62 31.7301 34 28.3401 34H19.6701C16.2801 34 14.0001 31.62 14.0001 28.091V19.92C14.0001 16.38 16.2801 14 19.6701 14ZM23.4301 26.99L28.1801 22.24C28.5201 21.9 28.5201 21.35 28.1801 21C27.8401 20.66 27.2801 20.66 26.9401 21L22.8101 25.13L21.0601 23.38C20.7201 23.04 20.1601 23.04 19.8201 23.38C19.4801 23.72 19.4801 24.27 19.8201 24.62L22.2001 26.99C22.3701 27.16 22.5901 27.24 22.8101 27.24C23.0401 27.24 23.2601 27.16 23.4301 26.99Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="34.0029" y1="20.2259" x2="13.9983" y2="20.1838" gradientUnits="userSpaceOnUse"><stop stop-color="#3F74D1"></stop><stop offset="1" stop-color="#5B96E7"></stop></linearGradient></defs></svg>                  
                </div>
                <div className="middle_footer-text">
                    <h1 className="middle_footer-about">
                        Актуальная и проверенная информация. Приложение и сайт 
                        <span className="footer_first">{footerFirst}</span>
                        обслуживает команда профессионалов. Специалисты 
                        систематически обновляют данные, проводят аналитическую 
                        работу, отслеживают запросы потребителей. Отчеты о работе
                         ежедневно и еженедельно рассылаются партнерам.
                    </h1>
                </div>
            </div>
             <div className="footer_info">
                <div className="middle_footer-img">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg" class="_icon" data-v-45c0c5d5=""><rect width="48" height="48" rx="24" fill="#F4F5F7"></rect><path fill-rule="evenodd" clip-rule="evenodd" d="M14 22.6699C14 17.8817 17.8403 14 22.5776 14C24.8526 14 27.0343 14.9134 28.6429 16.5394C30.2516 18.1653 31.1553 20.3705 31.1553 22.6699C31.1553 27.4582 27.3149 31.3399 22.5776 31.3399C17.8403 31.3399 14 27.4582 14 22.6699ZM31.0134 29.6543L33.568 31.7165H33.6124C34.1292 32.2389 34.1292 33.0858 33.6124 33.6082C33.0955 34.1306 32.2576 34.1306 31.7407 33.6082L29.6207 31.1785C29.4203 30.9766 29.3076 30.7024 29.3076 30.4164C29.3076 30.1304 29.4203 29.8562 29.6207 29.6543C30.0072 29.2704 30.6268 29.2704 31.0134 29.6543Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="34.0028" y1="20.2259" x2="13.9982" y2="20.1838" gradientUnits="userSpaceOnUse"><stop stop-color="#3F74D1"></stop><stop offset="1" stop-color="#5B96E7"></stop></linearGradient></defs></svg>                  
                </div>
                <div className="middle_footer-text">
                    <h1 className="middle_footer-about">
                        Приложение для поиска легко и без проблем интегрируется
                         со многими широко распространенными программными обеспечениями
                          аптек, которые автоматизируют процессы в аптеке 
                          (FOM, ABU, 1C и т.д.). Для подключения нет необходимости
                           в сложной настройке оборудования торговой точки.
                    </h1>
                </div>
            </div>
            <div className="footer_info">
                <div className="middle_footer-img">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg" class="_icon" data-v-45c0c5d5=""><rect width="48" height="48" rx="24" fill="#F4F5F7"></rect><path fill-rule="evenodd" clip-rule="evenodd" d="M29.1799 16.41C29.1799 15.08 30.2599 14 31.5899 14C32.9199 14 33.9999 15.08 33.9999 16.41C33.9999 17.74 32.9199 18.82 31.5899 18.82C30.2599 18.82 29.1799 17.74 29.1799 16.41ZM25.3298 26.7593L28.2198 23.0303L28.1798 23.0503C28.3398 22.8303 28.3698 22.5503 28.2598 22.3003C28.1508 22.0503 27.9098 21.8803 27.6508 21.8603C27.3798 21.8303 27.1108 21.9503 26.9498 22.1703L24.5308 25.3003L21.7598 23.1203C21.5898 22.9903 21.3898 22.9393 21.1898 22.9603C20.9908 22.9903 20.8108 23.0993 20.6898 23.2593L17.7308 27.1103L17.6698 27.2003C17.4998 27.5193 17.5798 27.9293 17.8798 28.1503C18.0198 28.2403 18.1698 28.3003 18.3398 28.3003C18.5708 28.3103 18.7898 28.1893 18.9298 28.0003L21.4398 24.7693L24.2898 26.9103L24.3798 26.9693C24.6998 27.1393 25.0998 27.0603 25.3298 26.7593ZM27.4498 15.7803C27.4098 16.0303 27.3898 16.2803 27.3898 16.5303C27.3898 18.7803 29.2098 20.5993 31.4498 20.5993C31.6998 20.5993 31.9398 20.5703 32.1898 20.5303V28.5993C32.1898 31.9903 30.1898 34.0003 26.7898 34.0003H19.4008C15.9998 34.0003 13.9998 31.9903 13.9998 28.5993V21.2003C13.9998 17.8003 15.9998 15.7803 19.4008 15.7803H27.4498Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="34.0026" y1="20.226" x2="13.9979" y2="20.1839" gradientUnits="userSpaceOnUse"><stop stop-color="#3F74D1"></stop><stop offset="1" stop-color="#5B96E7"></stop></linearGradient></defs></svg>                  
                </div>
                <div className="middle_footer-text">
                    <h1 className="middle_footer-about">
                        Помогает бизнесу выходить на новый уровень и соответствовать 
                        современным IT-технологиям. Тщательно проработанная концепция 
                        поисковика в несколько раз увеличивает прибыль предприятия.
                    </h1>
                </div>
            </div>
            <div className="footer_info">
                <div className="middle_footer-img">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg" class="_icon" data-v-45c0c5d5=""><rect width="48" height="48" rx="24" fill="#F4F5F7"></rect><path fill-rule="evenodd" clip-rule="evenodd" d="M20.9258 28.39H26.3119C26.7178 28.39 27.0545 28.05 27.0545 27.64C27.0545 27.23 26.7178 26.9 26.3119 26.9H20.9258C20.5198 26.9 20.1832 27.23 20.1832 27.64C20.1832 28.05 20.5198 28.39 20.9258 28.39ZM24.2723 21.9H20.9258C20.5198 21.9 20.1832 22.24 20.1832 22.65C20.1832 23.06 20.5198 23.39 20.9258 23.39H24.2723C24.6782 23.39 25.0149 23.06 25.0149 22.65C25.0149 22.24 24.6782 21.9 24.2723 21.9ZM31.3381 21.0256C31.5708 21.0229 31.8242 21.02 32.0545 21.02C32.302 21.02 32.5 21.22 32.5 21.47V29.51C32.5 31.99 30.5099 34 28.0545 34H20.1733C17.599 34 15.5 31.89 15.5 29.29V18.51C15.5 16.03 17.5 14 19.9653 14H25.2525C25.5099 14 25.7079 14.21 25.7079 14.46V17.68C25.7079 19.51 27.203 21.01 29.0149 21.02C29.4381 21.02 29.8112 21.0232 30.1377 21.0259C30.3917 21.0281 30.6175 21.03 30.8168 21.03C30.9578 21.03 31.1405 21.0279 31.3381 21.0256ZM31.6111 19.566C30.7972 19.569 29.8378 19.566 29.1477 19.559C28.0527 19.559 27.1507 18.648 27.1507 17.542V14.906C27.1507 14.475 27.6685 14.261 27.9646 14.572C28.5006 15.135 29.2374 15.9089 29.9706 16.6792C30.7014 17.4469 31.4288 18.211 31.9507 18.759C32.2398 19.062 32.0279 19.565 31.6111 19.566Z" fill="url(#paint0_linear)"></path><defs><linearGradient id="paint0_linear" x1="32.5024" y1="20.2259" x2="15.4984" y2="20.1955" gradientUnits="userSpaceOnUse"><stop stop-color="#3F74D1"></stop><stop offset="1" stop-color="#5B96E7"></stop></linearGradient></defs></svg>                
                </div>
                <div className="middle_footer-text">
                    <h1 className="middle_footer-about">
                        Воспользоваться<span className="footer_first">{footerFirst}</span>
                        можно на смартфоне, скачав приложение. Приложение поддерживает 
                        современные операционные системы. Кроме этого, сервис доступен со 
                        стационарного ПК. Установленный поисковик не занимает много места в
                         памяти телефона.
                    </h1>
                </div>
            </div>
        </footer>
    );

};

export default MiddleFooter;